InternalWork/stm32f103-template-lib/vectors.cpp
void MemManage_Handler(void) __attribute__((weak, alias ("Default_Handler")));
void BusFault_Handler(void) __attribute__((weak, alias ("Default_Handler")));
void UsageFault_Handler(void) __attribute__((weak, alias ("Default_Handler")));
void SVC_Handler(void) __attribute__((weak, alias ("Default_Handler")));
void DebugMon_Handler(void) __attribute__((weak, alias ("Default_Handler")));
void PendSV_Handler(void) __attribute__((weak, alias ("Default_Handler")));
void SysTick_Handler(void) __attribute__((weak, alias ("Default_Handler")));
void WWDG_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void PVD_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TAMPER_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void RTC_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void FLASH_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void RCC_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void EXTI0_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void EXTI1_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void EXTI2_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void EXTI3_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void EXTI4_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA1_Channel1_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA1_Channel2_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA1_Channel3_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA1_Channel4_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA1_Channel5_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA1_Channel6_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA1_Channel7_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void ADC1_2_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void USB_HP_CAN1_TX_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void USB_LP_CAN1_RX0_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void CAN1_RX1_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void CAN1_SCE_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void EXTI9_5_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void EXTI15_10_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM1_BRK_TIM9_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM1_TRG_COM_TIM11_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM1_CC_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM2_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM3_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM4_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void I2C1_EV_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void I2C1_ER_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void I2C2_EV_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void I2C2_ER_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void SPI1_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void SPI2_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void USART1_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void USART2_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void USART3_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void RTCAlarm_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void USBWakeUp_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM8_BRK_TIM12_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM8_UP_TIM13_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM8_TRG_COM_TIM14_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM8_CC_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void ADC3_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void FSMC_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void SDIO_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM5_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void SPI3_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void UART4_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void UART5_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM6_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void TIM7_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA2_Channel1_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA2_Channel2_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA2_Channel3_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));
void DMA2_Channel4_5_IRQHandler(void) __attribute__((weak, alias ("Default_Handler")));

void __attribute__ ((section (".isr_vector"))) (*const irq_vectors[])(void) = {
	(void (*)()) &__stack,
	Reset_Handler,
	NMI_Handler,
	HardFault_Handler,
	MemManage_Handler,
	BusFault_Handler,
	UsageFault_Handler,
	0,
	0,
	0,
	0,
	SVC_Handler,
	DebugMon_Handler,
	0,
	PendSV_Handler,
	SysTick_Handler,
	WWDG_IRQHandler,
	PVD_IRQHandler,
	TAMPER_IRQHandler,
	RTC_IRQHandler,
	FLASH_IRQHandler,
	RCC_IRQHandler,
	EXTI0_IRQHandler,
	EXTI1_IRQHandler,
	EXTI2_IRQHandler,
	EXTI3_IRQHandler,
	EXTI4_IRQHandler,
	DMA1_Channel1_IRQHandler,
	DMA1_Channel2_IRQHandler,
	DMA1_Channel3_IRQHandler,
	DMA1_Channel4_IRQHandler,
	DMA1_Channel5_IRQHandler,
	DMA1_Channel6_IRQHandler,
	DMA1_Channel7_IRQHandler,
	ADC1_2_IRQHandler,
	USB_HP_CAN1_TX_IRQHandler,
	USB_LP_CAN1_RX0_IRQHandler,
	CAN1_RX1_IRQHandler,
	CAN1_SCE_IRQHandler,
	EXTI9_5_IRQHandler,
	TIM1_BRK_TIM9_IRQHandler,
	TIM1_UP_TIM10_IRQHandler,
	TIM1_TRG_COM_TIM11_IRQHandler,
	TIM1_CC_IRQHandler,
	TIM2_IRQHandler,
	TIM3_IRQHandler,
	TIM4_IRQHandler,
	I2C1_EV_IRQHandler,
	I2C1_ER_IRQHandler,
	I2C2_EV_IRQHandler,
	I2C2_ER_IRQHandler,
	SPI1_IRQHandler,
	SPI2_IRQHandler,
	USART1_IRQHandler,
	USART2_IRQHandler,
	USART3_IRQHandler,
	EXTI15_10_IRQHandler,
	RTCAlarm_IRQHandler,
	USBWakeUp_IRQHandler,
	TIM8_BRK_TIM12_IRQHandler,
	TIM8_UP_TIM13_IRQHandler,
	TIM8_TRG_COM_TIM14_IRQHandler,
	TIM8_CC_IRQHandler,
	ADC3_IRQHandler,
	FSMC_IRQHandler,
	SDIO_IRQHandler,
	TIM5_IRQHandler,
	SPI3_IRQHandler,
	UART4_IRQHandler,
	UART5_IRQHandler,
	TIM6_IRQHandler,
	TIM7_IRQHandler,
	DMA2_Channel1_IRQHandler,
	DMA2_Channel2_IRQHandler,
	DMA2_Channel3_IRQHandler,
	DMA2_Channel4_5_IRQHandler,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	(void *) 0xF1E0F85F};

